[{
	"name": "Camille Eddy",
	"keynote": true,
	"company_role": "Girl STEM Stars",
	"title": "Recognizing cultural bias in AI",
	"avatar_url": "/assets/img/speakers/camille_eddy.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "nikkymill",
	"twitter_real": "nikkymill",
	"linked_in": "camilleeddy",
	"website": "https://hellocami.com",
	"bio": "<p>Camille Eddy began working on advanced robotics during an internship at HP Inc’s headquarters in Palo Alto, California as a Machine Learning Intern. She continued to intern at X, formerly Google X, in their robotics initiative and then at NVIDIA where she worked on autonomous cars. She is currently studying for a Bachelor's degree in Mechanical Engineering.</p><p>Camille speaks nationally on inclusion in the tech community and regularly writes on the topic. She also enjoys volunteering for STEM advocacy organizations for young girls and students.</p>",
	"talk": "<p>In a world that is being increasingly run on artificial intelligence, do we understand how algorithms make their decisions? In situations where humans have trouble making the right choices for culture—including race, language, accessibility, and equality—the algorithms we use should also face the same questions.</p><p>Camille Eddy walks you through how the services we all use everyday have adapted machine learning to become more inclusive. Camille also explains what we can do to create culturally sensitive computer intelligence and why that is important for the future of AI.</p>",
	"time": false
},{
	"name": "Sally Elatta",
	"keynote": true,
	"company_role": "CEO, Agile Transformation Inc. and Founder, AgilityHealth and AgileVideos.com",
	"title": "Be Bold, Be Real and Lead with Love",
	"avatar_url": "/assets/img/speakers/sally_elatta.png",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"website": "https://agiletransformation.com",
	"twitter": "sallyElatta",
	"twitter_real": "sallyElatta",
	"bio": "Sally Elatta is the president of Agile Transformation Inc, founder of AgilityHealth and <a href='https://www.agilevideos.com' target='_blank'>AgileVideos.com</a>. She is a successful entrepreneur and thought leader in the space of Enterprise Business Agility and Measurement. Sally is a dynamic and engaging speaker who advises top executives of the leading global enterprises through their Enterprise Business Agility (EBA) transformations.",
	"talk": "From her personal journey of overcoming barriers, as a young girl born in Sudan who migrated to the US with her family to starting her business which thrived despite tough economic times, Sally weaves her life’s learnings throughout this keynote, inviting all in attendance to Be Bold, Be Real, and Lead with LOVE.",
	"time": false
},{
	"name": "Jennifer Wadella",
	"keynote": true,
	"company_role": "JavaScript Consultant, Founder of Kansas City Women in Technology",
	"title": "Hacking your work life __ balance to take over the world",
	"avatar_url": "/assets/img/speakers/jennifer_Wadella.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "jenniferWadella",
	"twitter_real": false,
	"linked_in": false,
	"website": "https://jenniferwadella.com",
	"bio": "Jennifer Wadella has been writing code since before she realized it was a credible career path. She currently works as a JavaScript Consultant and loves building performant web applications, speaking at technical conferences, and brewing kombucha. Jennifer is an active member of the KC tech community and the founder of Kansas City Women in Technology(KCWiT), an organization aimed at growing the number of women in technology careers in Kansas City. She is the PubConf Sydney 2018 Champion, a Silicon Prairie Champion Award Nominee, Rising Trendsetter STEMMy award-winner, and is apparently Missouri's Coolest Woman according to Pure Wow.",
	"talk": "Everyone has the same 24 hours in a day, so how do some people seem accomplish so much more? It’s time to learn to hack your work life __ balance to have more time to pursue your passion projects, spend more time with those you love, while keeping your work ethic strong. Let’s take over the world!",
	"time": false
},{
	"name": "Ash Banaszek",
	"keynote": false,
	"company_role": "Associate of User Experience, Union Pacific Railroad",
	"title": "Fail Faster: Quick UX Design Techniques to Drive Toward Success",
	"avatar_url": "/assets/img/speakers/ash_bzak.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "ashbzak",
	"twitter_real": "ashbzak",
	"website": false,
	"linked_in": "ashmb",
	"bio": "Ash Banaszek is a passionate and outspoken UX advocate at Union Pacific Railroad. She holds a masters of science in information science from Missouri University of Science and Technology in Rolla, MO and returns to her alma mater regularly to guest lecture in human factors and human-computer interaction courses. Ash is also an award-winning Toastmaster and uses her public speaking experience to infuse humor and thought-provoking questions into her talks. You can follow her on Twitter @ashbzak or linkedin.com/in/ashmb, or meet in person for lively conversation at a UX Happy Hour Book Club Meetup in Omaha, NE.",
	"talk": "Companies, project teams, and customers want everything fast. In our haste, we may design an idea and run with it to fruition… only to fail. This talk will give you simple design techniques to help you think through multiple solutions, remove the blinders, and get your team’s BUY IN to do it.",
	"time": false
},{
	"name": "Katie Briggs",
	"keynote": false,
	"company_role": "Product Designer, NPR",
	"title": "Research Meets Reality",
	"avatar_url": "/assets/img/speakers/katie_Briggs.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "sisternebraska",
	"twitter_real": "sisternebraska",
	"website": "https://katie-briggs.com",
	"linked_in": false,
	"bio": "<p>Katie Briggs is a product designer at NPR. She is currently part of NPR’s Incubation Lab, which focuses on innovative, user-centric solutions to public media’s business problems. Previously, she led design for experimental initiatives on mobile and voice-first platforms.</p><p>For her side hustle, Briggs also oversees branding and UX as creative director for Jean Franklin, an ethical and sustainable clothing line.</p><p>Previously, Briggs was at KPCC – Southern California Public Radio, where she led design and worked to further innovation and promote inclusivity in public media. Some of her other design work includes Houston Public Media, 42 and numerous freelance assignments. Her teaching and facilitating experience includes collegiate color theory and corporate identity courses and several workshops related to design and research. Briggs received her Bachelor of Journalism from the University of Nebraska-Lincoln.</p>",
	"talk": "If thinking about implementing user research into your process seems overwhelming, this session is for you. The goal of this workshop is to alleviate user research-related anxieties. You’ll walk out with the skills and confidence you need to conduct studies quickly and effectively.",
	"time": false
},{
	"name": "Nicole Damen",
	"keynote": false,
	"company_role": "Ph.D. student, Human-Centered Computing, University of Nebraska at Omaha",
	"title": "The power of asking questions: How to go from vague answers to meaningful stories",
	"avatar_url": "/assets/img/speakers/nicole_damen.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter":"nicoleDamen",
	"twitter_real":false,
	"website": false,
	"linked_in": "thenicoledamen",
	"bio": "Hi, I’m a Dutch-Chinese Psychology major who recently transitioned into IT through the Ph.D. in Human-Centered Computing program at the University of Nebraska at Omaha. I’m passionate about design, productivity hacking, esports/gaming, and skiing/fitness, but I’m equally comfortable discussing communication, psychology, ethics, diversity & inclusion, self-improvement, and business. Looking forward to connecting with you and listening to your story, maybe we can do something cool together! :)",
	"talk": "“On a scale from 1 to 10, what is your favorite coffee?” Wait, what? Bad questions generate useless answers, yet more energy is spent on visual design than survey design. Stop wasting your time and learn how to ask questions that tell you what you want to know, not what you want to hear.",
	"time": false
},{
	"name": "Grishma Jena",
	"keynote": false,
	"company_role": "Cognitive Software Engineer, IBM Watson",
	"title": "A hands-on introduction to Natural Language Processing in Python",
	"avatar_url": "/assets/img/speakers/grishma_jena.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "DebateLover",
	"twitter_real": "DebateLover",
	"linked_in": "grishmajena/",
	"website": "gjena.github.io",
	"bio": "Grishma is a Cognitive Software Engineer with the Data Science for Marketing team at IBM Watson in San Francisco. She earned her Masters in Computer Science at University of Pennsylvania. Her research interests are in Machine Learning and Natural Language Processing. She was recently a mentor for AI4ALL's AI Project Fellowship Spring 2018 where she guided a group of high school students to use AI for prioritizing 911 EMS calls. In her free time, she writes, cooks and likes conducting workshops and delivering talks.",
	"talk": "This workshop introduces Natural Language Processing using Python. Attendees start off with textual data and learn how to process it to derive useful insights that can be used in real-world applications like sentiment analysis, topic modeling, similarity detection.",
	"time": false
},{
	"name": "Eris Koleszar",
	"keynote": false,
	"company_role": "Co-founder, Mystery Code Society",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/eris_koleszar.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter":"bellicapax",
	"twitter_real":"bellicapax",
	"linked_in": false,
	"website": false,
	"bio": "Eris Koleszar is a queer, trans game developer in her fifth year in the videogame industry. After four years with local mobile developer SkyVu, she left Omaha to join the creative minds at Funomena in San Francisco, where she's working on an unannounced virtual reality title. In 2016, she helped start and teach the first Girls Who Code club in Omaha. Two years later, Eris helped form the non-profit Mystery Code Society, which offers more specialized and advanced coding classes for women, femmes, and non-men. With MCS, she taught and developed curriculum for three classes specializing in game development and currently serves on the board. Outside of work and volunteering, her main goal is collaborating with her partner Hannah to mediate peace between their newly acquainted cats, Gus and Lilith.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
},{
	"name": "Angela McGraw",
	"keynote": false,
	"company_role": "iSTEM Coordinator, University of Nebraska at Omaha",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/angela_mcgraw.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter":"angelaMcgraw",
	"twitter_real":false,
	"linked_in": false,
	"website": false,
	"bio": "Angela McGraw holds a master’s degree in Education Administration from the University of Nebraska-Lincoln.  She is currently the iSTEM Coordinator at the University of Nebraska Omaha, where she oversees all K-12 outreach programs for the College of Information Science and Technology.  She is an advocate for diversity and inclusion in tech, exposing roughly 400 students annually to IT related academic workshops and career opportunities.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
},{
	"name": "Stefanie Monge",
	"keynote": false,
	"company_role": "Digital Recruiter, University of Nebraska Omaha",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/stefanie_monge.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "stefanieMonge",
	"twitter_real": false,
	"linked_in": "stefaniemonge",
	"website": false,
	"bio": "Stefanie is a dynamic strategist and communications pro with 12+ years of experience working with startups and founders around the world. From starting her career at the Omaha World-Herald writing about entrepreneurship, to working for Silicon Valley tech startups, to leading international retreats and conferences for female founders - Stefanie’s passion is empowering women through leadership development and connecting them with opportunities. During the day, Stefanie builds marketing automation programs to support recruitment across the University of Nebraska at Omaha. In her spare time, she mentors and serves as the Vice Chair of GETconf, in addition to other volunteer efforts to champion women and girls in tech.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion, moderated by Stefanie Monge, features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
},{
	"name": "Amy Newell",
	"keynote": false,
	"company_role": "Director of Engineering, Wistia",
	"title": "Suffering, Authenticity, and Productivity: Lessons I learned from Bipolar Disorder",
	"avatar_url": "/assets/img/speakers/amy_Newell.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "amynewell",
	"twitter_real": "amynewell",
	"linked_in": "amynewell/",
	"website": false,
	"bio": "Amy Newell is Director of Engineering at Wistia. She’s been a software engineer since 1999, and has been programming in Ruby since 2007, when she brought her three-month-old daughter to her first Ruby meetup. She is interested in the relationship between suffering, productivity and authenticity in the workplace. She writes and speaks about mental health, empathy, and managing engineers. She suffers from bipolar disorder. She’s also a poet, mom, food snob, and boot fanatic.",
	"talk": "We all suffer. Suffering in silence is bad for humans and business. Based on my years of experience managing engineering teams and my own struggle with bipolar disorder I argue for and provide tools to build authentic workplace cultures that are more productive AND humane.",
	"time": false
},{
	"name": "Victoria Novak",
	"keynote": false,
	"company_role": "Director of Workforce & IT Innovation, Metropolitan Community College",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/victoria_novak.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "victoriaNovak",
	"twitter_real": false,
	"linked_in": false,
	"website": "https://www.mccneb.edu/wid",
	"bio": "Victoria Novak is the Director of Workforce & IT Innovation at Metropolitan Community College, Center for Advanced and Emerging Technology, a position that aims to drive public-private partnerships to enhance the Omaha area’s labor pool. Her role at MCC is to provide leadership to the Workforce Innovation Division, which focuses on advancing people and fueling business growth through accelerated learning opportunities. Victoria will graduate in May with a Masters of Public Administration program at University of Nebraska at Omaha with a nonprofit concentration. She serves as the Engagement Committee Chairperson for the Omaha STEM Ecosystem, a VEX robotics judge, Council Member with the Greater Omaha Chamber of Commerce’s Diversity & Inclusion Council (CODE), mentors young women at University of Nebraska at Omaha’s Women in IT Mentoring Program and Board Member of the Butler-Gast & Maple Street YMCA’s. Victoria is a recent empty-nester who loves traveling the world and passionate about cast-iron cooking in the outdoors.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion, moderated by Stefanie Monge, features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
},{
	"name": "Eva PenzeyMoog",
	"keynote": false,
	"company_role": "Lead Designer, 8th Light",
	"title": " Designing Against Domestic Violence",
	"avatar_url": "/assets/img/speakers/eva_PenzeyMoog.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "epenzeymoog",
	"twitter_real": "epenzeymoog",
	"linked_in": false,
	"website": "https://www.evapenzeymoog.com",
	"bio": "Eva is a Lead Designer at 8th Light, a software consultancy in Chicago. She specializes in UX but also loves writing front-end code, and takes on workplace projects that make 8th Light a more diverse and inclusive place. Outside of work, she spends time mentoring underrepresented minorities in tech and fund raising for feminist organizations. Her remaining time is spent creating botanical cyanotype prints, consuming any zombie-related media she can get her hands on, and playing with her two dogs, Hamlet and Horatio.",
	"talk": "The reality of domestic violence doesn’t disappear when people enter the digital world. How can we as technologists ensure that our products aren’t use for abuse? This talk will explore how to consider the reality of violence, recognize intervention points, and advocate for user safety.",
	"time": false
},{
	"name": "Gauri Ramesh",
	"keynote": false,
	"company_role": "Co-Founder, Girls Code Lincoln",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/gauri_ramesh.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "gajrkRamesh",
	"twitter_real": false,
	"linked_in": "gauriramesh",
	"website": "https://girlscodelincoln.com",
	"bio": "I'm a junior undergraduate student studying Computer Science at the Raikes School at the University of Nebraska-Lincoln. I grew up here in Omaha, NE. I'm one of the co-founders of Girls Code Lincoln, a nonprofit in Lincoln, Nebraska that introduces girls to technology with creativity, community, collaboration, and confidence. I'm the director of curriculum, so I find cool projects that make technology interesting for kids, especially those in underrepresented groups. I'm passionate about diversity and inclusion in STEM. Outside of school and nonprofit work, I love to drink coffee and read books. My technical interests include backend web and mobile development and machine learning. After graduation, I plan to become a Software Engineer before eventually pursuing my master's or MBA.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
},{
	"name": "Noni Williams",
	"keynote": false,
	"title": "Data Science is (and should be) Intersectional",
	"company_role": "Manager of Solutions and Continuous Improvement",
	"avatar_url": "/assets/img/speakers/noni_williams.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "noniWilliams",
	"twitter_real": false,
	"linked_in": "noni-williams/",
	"bio": "Noni Williams finds her passion in solving problems and helping others understand that they are capable of solving problems too. This is evident in her current position as Manager of Solutions and Continuous Improvement where she works with data and extending the capacity for using data with after school professionals. She has a BA in Mathematics and is pursuing an MS in Mathematics with a concentration in Data Science. For Noni, data science is the perfect intersection between innovative problem solving, computer science, statistics, and math. In her free time, she enjoys writing poetry, nature photography, and solving problems on projecteuler.net.",
	"talk": "Data science is a relatively new term, and is used to describe the field that lies at the cross section of mathematics, statistics, information science, and computer science. It is a vehicle for understanding and analyzing the world around us. In this talk, I will walk through what the life of a typical data science project looks like, as well as what my personal path has looked like thus far through the world of data science.",
	"time": false
},{
	"name": "Jennifer Wong",
	"keynote": false,
	"title": "Empathetic Design Systems",
	"company_role": "Product Engineer, Envoy",
	"avatar_url": "/assets/img/speakers/jenn_Wong.jpg",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "jenniferWong",
	"twitter_real": false,
	"linked_in": false,
	"website": "http://www.mochimachine.com/",
	"bio": "Jennifer Wong is a self-taught software engineer. She spends her days making the web a prettier and more user-friendly place. She has written for Net Magazine and had projects covered by Mashable, Engadget, Gizmodo, and more. Jenn is an avid conference speaker and loves eating, coding, and sleeping.",
	"talk": "How do you make a design system empathetic and whom should it be empathetic towards? How can empathy help shape an ever-changing, morphing design system? Come learn how to build an empathetic design system from the ground up or start incorporating empathy today!",
	"time": false
},{
	"name": "Lee Zuvanich",
	"keynote": false,
	"company_role": "Principal Business Analyst, illumisoft",
	"title": "Panel: Strengthening the STEM Pipeline",
	"avatar_url": "/assets/img/speakers/lee_zuvanich.png",
	"social_avatar_url": "/assets/img/speakers/filler-social.jpg",
	"twitter": "enbylee",
	"twitter_real": "enbylee",
	"linked_in": "leezuvanich/",
	"website": false,
	"bio": "Lee Zuvanich is a serial entrepreneur with a background in web coding + design, tech support, and team management. They are the principal business analyst at an enterprise-level software development agency. Lee is also is the director of Coding & Cupcakes, a nonprofit that teaches girls to code. Lee’s favorite thing to do is disconnect in the woods with their dog and kids.",
	"talk": "Engaging young women and gender-expansive students in STEM subjects opens their eyes to new career pathways they might not have considered before, including an array of jobs with a promising future. This panel discussion features four organizations working to fill the STEM pipeline, how they are addressing the problem at hand, and what you can do to get involved.",
	"time": false
}]
